# Phase 2 Project

    Student name: Phase 2 Group 8 (Damaris Wanjiru / Henry Kemboi / Elizabeth Atieno / Gerald Muhia / Caleb Kipkech / Collins Kwata)
    Student pace: Full Time Remote
    Scheduled project review date/time:
    Instructor name: Asha Deen

# Project Overview

Our company is launching a new film studio to tap into the growing demand for original video content. With no prior experience in the industry, we have been tasked with analyzing current box office trends to identify the most successful film types. The goal is to deliver actionable insights that will guide the studio's direction and ensure a strong start in the competitive movie market.

# Business Understanding
* **Business Context**: Ourcompany aims to enter the original video content market by launching a new film studio, despite having no experience in movie production. To ensure success, we are tasked with analyzing current box office trends to identify top-performing film types. Our insights will guide the studio's leadership in making informed decisions about which genres to focus on.
*  **Problem Statement**: We need to identify top-performing film type, understand the trends of current box office and evaluate the impact of different factors on the film perfomance

# Objectives
1. Analyze the correlation between runtime and genre to determine which genre achieves the highest average ratings based on film duration.
2. Evaluate the impact of release date on genre ratings to identify trends and pinpoint which genres consistently receive high ratings over time.
3. Analyze audience preferences across different MPAA ratings to understand how each rating category appeals to various demographics.4Identify the genre that 
4. Assess directors' performance to determine which has achieved the highest return on investment within specific genres.
5. Identify directors known for producing critically acclaimed works within top-rated genres.
6. Determine which movie has achieved the highest return on investment, considering both production costs and box office earnings.

### Importing the Relevant Libraries

In [1]:
# importing relevant libraries
import pandas as pd 
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from scipy import stats
import sqlite3


%matplotlib inline

### Loading  The Data Review Each Dataset Individually

### Review Dataset

In [2]:
# Loading the Review tsv dataset display first and last 5 rows
df_review= pd.read_csv("dsc-phase-2-project-v3/zippedData/rt.reviews.tsv.gz", delimiter='\t', encoding='ISO-8859-1')
df_review.head()

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"

### Movie DB Dataset

In [3]:
# Load the Movie Db Dataset and Display the First and Last Five Rows
moviesdb_df= pd.read_csv("dsc-phase-2-project-v3/zippedData/tmdb.movies.csv.gz", compression='gzip')
moviesdb_df.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

### Movie_Info Dataset

In [4]:
# Loading movie_info tsv and Display the First and Last Five Rows
movie_info_df= pd.read_csv("dsc-phase-2-project-v3/zippedData/rt.movie_info.tsv.gz", sep='\t', compression='gzip')
movie_info_df.head()

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

### Movie Budgets Dataset

In [5]:
# Loading movie budget tsv and Display the First and Last Five Rows

In [6]:
df_budget= pd.read_csv(r"dsc-phase-2-project-v3/zippedData/tn.movie_budgets.csv.gz")
df_budget.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

### Bom Movie Gross Dataset From Box office

In [7]:
bom_gross_df =pd.read_csv("dsc-phase-2-project-v3/zippedData/bom.movie_gross.csv.gz")
bom_gross_df.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

### Loading SQL Database and creating a connection

In [8]:
#Access the Database

conn = sqlite3.connect("dsc-phase-2-project-v3/zippedData/im.db.db")

In [9]:
#Access the table names

table_name_query = """SELECT name 
                      AS 'Table Names' 
                      FROM sqlite_master 
                      WHERE type='table';"""

pd.read_sql(table_name_query, conn)

     Table Names
0   movie_basics
1      directors
2      known_for
3     movie_akas
4  movie_ratings
5        persons
6     principals
7        writers

In [29]:
# Rename DataFrames for Improved Analysis and Data Manipulation
df1 = bom_gross_df
df4 = df_budget

In [11]:
# Selecting key information for analysis from multiple tables in the database, including 
# movie titles, release years, runtime, genres, ratings, vote counts, director names, and
# professions. 
# This query integrates data from `movie_basics`, `movie_ratings`, `directors`, and `persons
# tables to align with project objectives.
df2 =pd.read_sql("""

SELECT DISTINCT original_title, 
                start_year,
                runtime_minutes,
                genres,
                averagerating,
                numvotes,
                primary_name,
                primary_profession
  FROM movie_basics
       JOIN movie_ratings
       ON movie_basics.movie_id = movie_ratings.movie_id
              JOIN directors
               ON movie_ratings.movie_id = directors.movie_id
                  JOIN persons
                    ON directors.person_id = persons.person_id;
 

""",conn)

df2

,original_title,start_year,runtime_minutes,genres,averagerating,numvotes,primary_name,primary_profession
0,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77,Harnam Singh Rawail,"director,writer,producer"
1,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",7.2,43,Mani Kaul,"director,writer,actor"
2,The Other Side of the Wind,2018,122.0,Drama,6.9,4517,Orson Welles,"actor,director,writer"
3,Sabse Bada Sukh,2018,NaN,"Comedy,Drama",6.1,13,Hrishikesh Mukherjee,"director,editor,writer"
4,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy",6.5,119,Raoul Ruiz,"director,writer,producer"
...,...,...,...,...,...,...,...,...
86019,Diabolik sono io,2019,75.0,Documentary,6.2,6,Giancarlo Soldi,"director,writer,producer"
86020,Sokagin Çocuklari,2019,98.0,"Drama,Family",8.7,136,Ahmet Faik Akinci,"director,writer"
86021,Albatross,2017,NaN,Documentary,8.5,8,Chris Jordan,"director,writer,editor"
86022,La vida sense la Sara Amat,2019,NaN,None,6.6,5,Laura Jou,"miscellaneous,actress,director"
86023,Drømmeland,2019,72.0,Documentary,6.5,11,Joost van der Wiel,"director,cinematographer,writer"

In [12]:
# We rename the common column in both dataFrames
df1.rename(columns ={"title":"Movie_title"}, inplace = True)
df2.rename(columns ={"original_title":"Movie_title"}, inplace = True)

In [13]:
# Confirming that the renaming has been updated in df1
df1.head()

,Movie_title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [14]:
# Confirming that the renaming has been updated in df2
df2.head()

,Movie_title,start_year,runtime_minutes,genres,averagerating,numvotes,primary_name,primary_profession
0,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77,Harnam Singh Rawail,"director,writer,producer"
1,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",7.2,43,Mani Kaul,"director,writer,actor"
2,The Other Side of the Wind,2018,122.0,Drama,6.9,4517,Orson Welles,"actor,director,writer"
3,Sabse Bada Sukh,2018,NaN,"Comedy,Drama",6.1,13,Hrishikesh Mukherjee,"director,editor,writer"
4,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy",6.5,119,Raoul Ruiz,"director,writer,producer"

In [15]:
#Merge the two dataframes on a common feature Movie_title

df3 = df1.merge(df2, on = 'Movie_title', how = 'left')

In [16]:
# checking the shape number of rows and columns our  new data set has
df3.shape

(4023, 12)

In [17]:
# check the first and last few rows
df3.head()

,Movie_title,studio,domestic_gross,foreign_gross,year,start_year,runtime_minutes,genres,averagerating,numvotes,primary_name,primary_profession
0,Toy Story 3,BV,415000000.0,652000000,2010,2010.0,103.0,"Adventure,Animation,Comedy",8.3,682218.0,Lee Unkrich,"editorial_department,editor,miscellaneous"
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Inception,WB,292600000.0,535700000,2010,2010.0,148.0,"Action,Adventure,Sci-Fi",8.8,1841066.0,Christopher Nolan,"writer,producer,director"
4,Shrek Forever After,P/DW,238700000.0,513900000,2010,2010.0,93.0,"Adventure,Animation,Comedy",6.3,167532.0,Mike Mitchell,"actor,director,writer"

In [25]:
# Checking for duplicates based on movie title
duplicates_df1 = df1[df1.duplicated(subset="Movie_title")]

In [26]:
# How many dduplicates are there?
print(len(duplicates_df1))

1

In [27]:
# The rows of the dduplicates in df
duplicates_df1.tail()

     Movie_title studio  domestic_gross foreign_gross  year
3045   Bluebeard  WGUSA         43100.0           NaN  2017

In [28]:
#duplicates_df2 = df2[df2.duplicated(subset="Movie_title")]

In [22]:
#print(len(duplicates_df2))

15637

In [23]:
#duplicates_df2.tail()

,Movie_title,start_year,runtime_minutes,genres,averagerating,numvotes,primary_name,primary_profession
86003,Jessie,2019,106.0,"Horror,Thriller",8.5,100,Aswani Kumar V.,"director,writer"
86011,Hand Rolled,2019,90.0,Documentary,9.3,13,Jesse Mariut,None
86013,Unstoppable,2019,84.0,Documentary,8.1,8,Nick Willing,"writer,director,producer"
86021,Albatross,2017,NaN,Documentary,8.5,8,Chris Jordan,"director,writer,editor"
86023,Drømmeland,2019,72.0,Documentary,6.5,11,Joost van der Wiel,"director,cinematographer,writer"

In [31]:
# Renaming movie column in df4 to have a commom feature we can merge on
df4.rename(columns ={"movie":"Movie_title"}, inplace = True)
df4.head()

,id,release_date,Movie_title,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [32]:
# Merging df4 with df3 to create a comprehensive master dataset for analysis

df5 = df3.merge(df4, on = 'Movie_title', how = 'left')
df5.head()

,Movie_title,studio,domestic_gross_x,foreign_gross,year,start_year,runtime_minutes,genres,averagerating,numvotes,primary_name,primary_profession,id,release_date,production_budget,domestic_gross_y,worldwide_gross
0,Toy Story 3,BV,415000000.0,652000000,2010,2010.0,103.0,"Adventure,Animation,Comedy",8.3,682218.0,Lee Unkrich,"editorial_department,editor,miscellaneous",47.0,"Jun 18, 2010","$200,000,000","$415,004,880","$1,068,879,522"
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Inception,WB,292600000.0,535700000,2010,2010.0,148.0,"Action,Adventure,Sci-Fi",8.8,1841066.0,Christopher Nolan,"writer,producer,director",38.0,"Jul 16, 2010","$160,000,000","$292,576,195","$835,524,642"
4,Shrek Forever After,P/DW,238700000.0,513900000,2010,2010.0,93.0,"Adventure,Animation,Comedy",6.3,167532.0,Mike Mitchell,"actor,director,writer",27.0,"May 21, 2010","$165,000,000","$238,736,787","$756,244,673"

In [ ]:
#duplicates_df5 = df5[df5.duplicated(subset="Movie_title")]

In [ ]:
#print(len(duplicates_df5))

In [36]:
# Checking the shape of our master data
print(f"We have {df5.shape[0]} rows and {df5.shape[1]} columns")

We have 4043 rows and 17 columns

In [44]:
# Getting to understand the structure of our data through a concise summary
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4043 entries, 0 to 4042
Data columns (total 17 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Movie_title         4043 non-null   object
 1   studio              4037 non-null   object
 2   domestic_gross_x    4008 non-null   float64
 3   foreign_gross       2466 non-null   object
 4   year                4043 non-null   int64
 5   start_year          2792 non-null   float64
 6   runtime_minutes     2727 non-null   float64
 7   genres              2787 non-null   object
 8   averagerating       2792 non-null   float64
 9   numvotes            2792 non-null   float64
 10  primary_name        2792 non-null   object
 11  primary_profession  2792 non-null   object
 12  id                  1589 non-null   float64
 13  release_date        1589 non-null   object
 14  production_budget   1589 non-null   object
 15  domestic_gross_y    1589 non-null   object
 16  worldwide_gross     1589 non-null   object
dtypes: float64(6), int64(1), object(10)
memory usage: 537.1+ KB

##### There seems to be alot of missing data

In [ ]:
# Make a copy before uttering the data
df6 = df5.copy()

### Data Cleaning and Checkig for Missing Values

In [41]:
# Checking for duplicate
print(f"We have {df5.duplicated().sum()} duplicates in this dataset")

We have 0 duplicates in this dataset

#### Check For Missing Values

In [45]:
df5.isna().sum()

Movie_title              0
studio                   6
domestic_gross_x        35
foreign_gross         1577
year                     0
start_year            1251
runtime_minutes       1316
genres                1256
averagerating         1251
numvotes              1251
primary_name          1251
primary_profession    1251
id                    2454
release_date          2454
production_budget     2454
domestic_gross_y      2454
worldwide_gross       2454
dtype: int64

 ##### Percentage of Null values

In [50]:
# Calculate null percentage for each column
null_percentage = [(col, (df5[col].isna().sum() / len(df5)) * 100) for col in df5.columns]

# Create a DataFrame from the null percentages
null_percentage_df = pd.DataFrame(null_percentage, columns=["Columns", "Null Percentages"])

# Sort in descending order
null_percentage_df = null_percentage_df.sort_values(by="Null Percentages", ascending=False)
null_percentage_df

               Columns  Null Percentages
13        release_date         60.697502
12                  id         60.697502
14   production_budget         60.697502
15    domestic_gross_y         60.697502
16     worldwide_gross         60.697502
3        foreign_gross         39.005689
6      runtime_minutes         32.550087
7               genres         31.066040
5           start_year         30.942370
10        primary_name         30.942370
11  primary_profession         30.942370
9             numvotes         30.942370
8        averagerating         30.942370
2     domestic_gross_x          0.865694
1               studio          0.148405
0          Movie_title          0.000000
4                 year          0.000000

##### Working with a dataset containing columns with 60% nulls can be challenging, but retaining these columns can be advantageous if they hold significant relevance to your business problem. Here’s why keeping these columns but working with fewer rows can be beneficial:

* Preserving Feature Diversity: Retaining column structure while using fewer rows maintains a broader set of features, potentially leading to a more comprehensive and balanced analysis.

* Enhancing Model Relevance: Retaining high-relevance columns (even with some missing data) can improve model accuracy, especially if these columns strongly influence the target variable. This approach may yield more relevant predictions compared to models with higher row counts but less meaningful features.

* Maintaining Critical Information: If certain columns (e.g., production budget, domestic/foreign revenue, runtime, or genre) are vital to the business question, dropping them would mean losing key metrics or context essential to achieving valuable insights.

* Avoiding Bias from Selective Imputation: Imputing values in high-null columns can introduce biases, especially if the missing data isn't randomly distributed. By carefully retaining rows rather than using selective imputation, the analysis remains more reliable and less prone to misleading conclusions.

By prioritizing relevant columns over row count, the dataset remains aligned with the primary analytical objectives, ultimately supporting more accurate and insightful outcomes while minimizing the risk of bias.

In [56]:
# Drop rows with null values and reassign to df5
cleaned_df5= df5.dropna()

# Check if there are any remaining null values
cleaned_df5.isna().sum()

Movie_title           0
studio                0
domestic_gross_x      0
foreign_gross         0
year                  0
start_year            0
runtime_minutes       0
genres                0
averagerating         0
numvotes              0
primary_name          0
primary_profession    0
id                    0
release_date          0
production_budget     0
domestic_gross_y      0
worldwide_gross       0
dtype: int64

In [57]:
# checking how many rows and columns in filtered df
print(f"We have {cleaned_df5.shape[0]} rows and {cleaned_df5.shape[1]} in our cleaned dataframe")

 we have 1264 rows and 17 in our cleaned dataframe

In [ ]:
#fig, ax =plt.subplots(figsize = (12,8))

#ax.hist(df5["domestic_gross_x"], bins = 5)
#x.tick_params(axis="x", labelrotation= 90);

In [ ]:
#columns_to_convert = ['production_budget', 'domestic_gross_y', 'worldwide_gross', 'foreign_gross']

for col in columns_to_convert:
    df5[col] = df5[col].replace('[\$,]', '', regex=True).astype(float)

In [ ]:
df5.info()

In [ ]:
#fig, ax =plt.subplots(nrows = 1,ncols =2, figsize = (12,8))

#ax[0].hist(df5["worldwide_gross"], bins = 5)
#ax[0].tick_params(axis="x", labelrotation= 90)
#ax[0].set_title("Worldwide gross")

#ax[1].hist(df5["production_budget"], bins = 5)
#ax[1].set_title("Production Budget")
#ax[1].tick_params(axis="x", labelrotation= 90)

#ax[3].hist(df5["domestic_gross_y"], bins = 5)
#ax[3].tick_params(axis="x", labelrotation= 90)

#ax[4].hist(df5["foreign_gross"], bins = 5)
#ax[4].tick_params(axis="x", labelrotation= 90)
;

In [ ]:
df5.describe()

In [ ]:
#fig, ax =plt.subplots(nrows = 1,ncols =2, figsize = (12,8))

#ax[0].hist(df5["domestic_gross_y"], bins = 5)
#ax[0].tick_params(axis="x", labelrotation= 90)
#ax[0].set_title("Domestic Gross")

#ax[1].hist(df5["foreign_gross"], bins = 5)
#ax[1].tick_params(axis="x", labelrotation= 90)
#ax[1].set_title("Foreign Gross")

In [ ]:
#df5["domestic_gross_y"] = df5["domestic_gross_y"].fillna(df5["domestic_gross_y"].median())
#df5["foreign_gross"] = df5["foreign_gross"].fillna(df5["foreign_gross"].median())

In [ ]:
#fig, ax =plt.subplots(nrows = 1,ncols =2, figsize = (12,8))

#ax[0].hist(df5["domestic_gross_y"], bins = 5)
#ax[0].tick_params(axis="x", labelrotation= 90)
#ax[0].set_title("Domestic Gross")

#ax[1].hist(df5["foreign_gross"], bins = 5)
#ax[1].tick_params(axis="x", labelrotation= 90)
#ax[1].set_title("Foreign Gross")

In [ ]:
#df5["worldwide_gross"] = df5["worldwide_gross"].fillna(df5["worldwide_gross"].median())

#df5["production_budget"] = df5["production_budget"].fillna(df5["production_budget"].median())

#df5["domestic_gross_x"] = df5["domestic_gross_x"].fillna(df5["domestic_gross_x"].median())

In [ ]:
fig, ax =plt.subplots(nrows = 1,ncols =2, figsize = (12,8))

ax[0].hist(df5["worldwide_gross"], bins = 5)
#ax[0].tick_params(axis="x", labelrotation= 90)
ax[0].set_title("Worldwide gross")

ax[1].hist(df5["production_budget"], bins = 5)
ax[1].set_title("Production Budget")

In [ ]:
df5.info()

In [ ]:
fig, ax =plt.subplots(figsize = (12,8))

ax.hist(df5["runtime_minutes"], bins = 5);

In [ ]:
#fig, ax =plt.subplots(figsize = (12,8))

#ax.hist(df5["averagerating"], bins = 5);

In [ ]:
#Splitting the genres column and creating the first entry in the genre column in a new colum "modified_genres"

#df5["modified_genres"] = df5["genres"].str.split(",").str[0]

#df.info()

In [ ]:
grouped_df = df5.groupby(["modified_genres"]).mean()

In [ ]:
grouped_df

In [ ]:
#def fill_runtime(row):
   # if pd.isna(row['runtime_minutes']):
        
       # return avg_runtime.get(row['genres'], row['runtime_minutes']) 
    #else:
       # return row['runtime_minutes']

In [ ]:
# Define the function
#def fill_runtime(row):
    #if pd.isna(row['runtime_minutes']):
      #  return avg_runtimes.get(row['genres'], row['runtime_minutes']) 
    #else:
       # return row['runtime_minutes']

In [ ]:
# Apply the function to fill missing runtimes
#df5['runtime_minutes'] = df5.apply(fill_runtime, axis=1)

In [ ]:
#finishing up on set objectives